# Aggregegations

In [2]:
import pandas as pd
import numpy as np

In [3]:
filename = "../ZZ_Data/cars.csv"
colsIwannaUse = ["Name", "Origin","Year", "Weight_in_lbs"]
dfOrg = pd.read_csv(filename, usecols=colsIwannaUse)
df = dfOrg[colsIwannaUse].copy()
df.Year = df.Year.str[:4]
df = df.set_index("Name")
df.head(3)

                          Origin  Year  Weight_in_lbs
Name
chevrolet chevelle malibu    USA  1970           3504
buick skylark 320            USA  1970           3693
plymouth satellite           USA  1970           3436

In [4]:
# Grouping

In [8]:
dfG = df.groupby("Origin").count()
dfG

        Year  Weight_in_lbs
Origin
Europe    73             73
Japan     79             79
USA      254            254

In [13]:
### Investigate how the average weight of the cars from the 3 origins changed over time
groupFields = ["Year","Origin"]
dfG = df.groupby(groupFields).mean()
dfG.head(6)
dfG.tail(6)

             Weight_in_lbs
Year Origin
1980 Europe    2348.000000
     Japan     2290.307692
     USA       2822.428571
1982 Europe    2544.285714
     Japan     2210.714286
     USA       2660.303030